cf/Catalogs/Companies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>Companies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Prefix</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/InformationRegisters/CompaniesResponsiblePersons.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>CompaniesResponsiblePersons</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CEO</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ChiefAccountant</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CTO</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/Catalogs/Companies/Forms/ItemForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	ResponsiblePersons = ResponsiblePersons(CurrentSessionDate(), Object.Ref);
	
	FillPropertyValues(ThisObject, ResponsiblePersons);
	
EndProcedure

&AtServer
Procedure OnWriteAtServer(Cancel, CurrentObject, WriteParameters)
	
	Try
	
		UpdateResponsiblePersons(CurrentObject.Ref);
	
	Except
		
		Cancel = True;
		ErrorText = StrTemplate(
			"Failed to update responsible persons with the error: %1",
			ErrorProcessing.BriefErrorDescription(ErrorInfo())
		);
		Message(ErrorText);

	EndTry;
	
EndProcedure

&AtServer
Procedure UpdateResponsiblePersons(Company)

	Period = CurrentSessionDate();
	
	ResponsiblePersons = ResponsiblePersons(Period, Company);
	
	If ResponsiblePersons.CEO <> CEO
		Or ResponsiblePersons.ChiefAccountant <> ChiefAccountant
		Or ResponsiblePersons.CTO <> CTO Then
				
		RecordManager = InformationRegisters.CompaniesResponsiblePersons.CreateRecordManager();
		
		RecordManager.Company = Company;
		RecordManager.Period = Period;
		
		RecordManager.CEO = CEO;
		RecordManager.ChiefAccountant = ChiefAccountant;
		RecordManager.CTO = CTO;
		
		RecordManager.Write(True);
		
	EndIf;

EndProcedure

&AtServerNoContext
Function ResponsiblePersons(Period, Company)

	Filter = New Structure("Company", Company);
	
	Return InformationRegisters.CompaniesResponsiblePersons.GetLast(
		Period,
		Filter
	);
	
EndFunction
